In [2]:
import pandas as pd

df = pd.read_csv('data_set.csv')

columns_to_convert = ["Bachelor's Degree Holders", "Science and Engineering", "Science and Engineering Related Fields",
					  "Business", "Education", "Arts, Humanities and Others"]

for column in columns_to_convert:
	df[column] = df[column].str.replace(',', '').astype(int)

df.head(5)

,State,Sex,Age Group,Bachelor's Degree Holders,Science and Engineering,Science and Engineering Related Fields,Business,Education,"Arts, Humanities and Others"
0,Alabama,Total,25 and older,885357,263555,98445,210147,141071,172139
1,Alabama,Total,25 to 39,268924,90736,32378,58515,29342,57953
2,Alabama,Total,40 to 64,418480,115762,46724,112271,63875,79848
3,Alabama,Total,65 and older,197953,57057,19343,39361,47854,34338
4,Alabama,Male,25 and older,405618,159366,26004,113909,29490,76849


Предоставленные данные представляют собой информацию о держателях степени бакалавра в разных возрастных группах и областях обучения в разных штатах США. В данном наборе данных доступны следующие переменные:

1. **State (Штат)**: Это указывает на штат, для которого предоставлены статистические данные. В данном случае, это штат Алабама.

2. **Sex (Пол)**: Эта переменная указывает на пол держателей степени бакалавра.

3. **Age Group (Возрастная группа)**: Эта переменная разделяет держателей степени бакалавра на несколько возрастных групп. В данном случае, возрастные группы включают "25 and older" (25 лет и старше), "25 to 39" (от 25 до 39 лет), "40 to 64" (от 40 до 64 лет) и "65 and older" (65 лет и старше).

4. **Bachelor's Degree Holders (Держатели степени бакалавра)**: Это количество людей, у которых есть степень бакалавра.

5. **Science and Engineering (Наука и инженерия)**: Это количество держателей степени бакалавра, чья область обучения связана с наукой и инженерией.

6. **Science and Engineering Related Fields (Смежные области науки и инженерии)**: Это количество держателей степени бакалавра, обучавшихся в областях, связанных с наукой и инженерией, но не являющихся точно научными или инженерными.

7. **Business (Бизнес)**: Это количество держателей степени бакалавра, обучавшихся в области бизнеса.

8. **Education (Образование)**: Это количество держателей степени бакалавра, обучавшихся в области образования.

9. **Arts, Humanities and Others (Искусство, гуманитарные науки и другие области)**: Это количество держателей степени бакалавра, обучавшихся в областях, включая искусство, гуманитарные науки и другие, не включенные в вышеперечисленные категории.

Данные, взяты с сайта https://www.kaggle.com/datasets/tjkyner/bachelor-degree-majors-by-age-sex-and-state/data.

In [3]:

filtered_data_age = df[df['Age Group'] == '25 and older']

filtered_data_age

,State,Sex,Age Group,Bachelor's Degree Holders,Science and Engineering,Science and Engineering Related Fields,Business,Education,"Arts, Humanities and Others"
0,Alabama,Total,25 and older,885357,263555,98445,210147,141071,172139
4,Alabama,Male,25 and older,405618,159366,26004,113909,29490,76849
8,Alabama,Female,25 and older,479739,104189,72441,96238,111581,95290
12,Alaska,Total,25 and older,146157,57375,14226,22507,17283,34766
16,Alaska,Male,25 and older,65820,30952,3713,11869,4418,14868
...,...,...,...,...,...,...,...,...,...
592,Wisconsin,Male,25 and older,579921,246334,37759,135142,48232,112454
596,Wisconsin,Female,25 and older,678458,157128,110228,115325,141116,154661
600,Wyoming,Total,25 and older,113557,41541,11843,16670,22550,20953
604,Wyoming,Male,25 and older,54483,25971,3373,9814,5912,9413
608,Wyoming,Female,25 and older,59074,15570,8470,6856,16638,11540


Мы отфильтровали данные для группы людей в возрасте 25 лет и старше. Это может быть полезно для анализа степеней бакалавра в более взрослых возрастных группах.

In [4]:
filtered_data_engineering = df[df['Science and Engineering'] > 100000]

filtered_data_engineering

,State,Sex,Age Group,Bachelor's Degree Holders,Science and Engineering,Science and Engineering Related Fields,Business,Education,"Arts, Humanities and Others"
0,Alabama,Total,25 and older,885357,263555,98445,210147,141071,172139
2,Alabama,Total,40 to 64,418480,115762,46724,112271,63875,79848
4,Alabama,Male,25 and older,405618,159366,26004,113909,29490,76849
8,Alabama,Female,25 and older,479739,104189,72441,96238,111581,95290
24,Arizona,Total,25 and older,1492158,512718,151885,312503,197335,317717
...,...,...,...,...,...,...,...,...,...
589,Wisconsin,Total,25 to 39,418338,146957,47406,83980,39823,100172
590,Wisconsin,Total,40 to 64,582291,182123,69388,132078,81199,117503
592,Wisconsin,Male,25 and older,579921,246334,37759,135142,48232,112454
594,Wisconsin,Male,40 to 64,267079,109918,18683,65988,21828,50662
596,Wisconsin,Female,25 and older,678458,157128,110228,115325,141116,154661


Мы отфильтровали данные для людей, обучавшихся в области науки и инженерии, и выбрали тех, у кого более 100 000 держателей степени бакалавра в этой области

In [5]:

filtered_data_business = df[df['Business'] > 50000]

filtered_data_business

,State,Sex,Age Group,Bachelor's Degree Holders,Science and Engineering,Science and Engineering Related Fields,Business,Education,"Arts, Humanities and Others"
0,Alabama,Total,25 and older,885357,263555,98445,210147,141071,172139
1,Alabama,Total,25 to 39,268924,90736,32378,58515,29342,57953
2,Alabama,Total,40 to 64,418480,115762,46724,112271,63875,79848
4,Alabama,Male,25 and older,405618,159366,26004,113909,29490,76849
6,Alabama,Male,40 to 64,184328,67977,12331,54931,12820,36269
...,...,...,...,...,...,...,...,...,...
590,Wisconsin,Total,40 to 64,582291,182123,69388,132078,81199,117503
592,Wisconsin,Male,25 and older,579921,246334,37759,135142,48232,112454
594,Wisconsin,Male,40 to 64,267079,109918,18683,65988,21828,50662
596,Wisconsin,Female,25 and older,678458,157128,110228,115325,141116,154661
598,Wisconsin,Female,40 to 64,315212,72205,50705,66090,59371,66841


Мы отфильтровали данные для группы людей, которые обучались в области бизнеса и у которых более 50,000 держателей степени бакалавра.

In [6]:
filtered_data_education = df[df['Education'] > 10000]

filtered_data_education

,State,Sex,Age Group,Bachelor's Degree Holders,Science and Engineering,Science and Engineering Related Fields,Business,Education,"Arts, Humanities and Others"
0,Alabama,Total,25 and older,885357,263555,98445,210147,141071,172139
1,Alabama,Total,25 to 39,268924,90736,32378,58515,29342,57953
2,Alabama,Total,40 to 64,418480,115762,46724,112271,63875,79848
3,Alabama,Total,65 and older,197953,57057,19343,39361,47854,34338
4,Alabama,Male,25 and older,405618,159366,26004,113909,29490,76849
...,...,...,...,...,...,...,...,...,...
598,Wisconsin,Female,40 to 64,315212,72205,50705,66090,59371,66841
599,Wisconsin,Female,65 and older,124349,18527,21247,7965,49968,26642
600,Wyoming,Total,25 and older,113557,41541,11843,16670,22550,20953
602,Wyoming,Total,40 to 64,50686,16255,5424,8904,10707,9396
608,Wyoming,Female,25 and older,59074,15570,8470,6856,16638,11540

Мы отфильтровали данные для держателей степени бакалавра в области образования (Education), у которых более 10 000 дипломов

In [7]:
filtered_data_arts = df[df['Arts, Humanities and Others'] > 30000]

filtered_data_arts

,State,Sex,Age Group,Bachelor's Degree Holders,Science and Engineering,Science and Engineering Related Fields,Business,Education,"Arts, Humanities and Others"
0,Alabama,Total,25 and older,885357,263555,98445,210147,141071,172139
1,Alabama,Total,25 to 39,268924,90736,32378,58515,29342,57953
2,Alabama,Total,40 to 64,418480,115762,46724,112271,63875,79848
3,Alabama,Total,65 and older,197953,57057,19343,39361,47854,34338
4,Alabama,Male,25 and older,405618,159366,26004,113909,29490,76849
...,...,...,...,...,...,...,...,...,...
593,Wisconsin,Male,25 to 39,179441,80561,9130,42710,8046,38994
594,Wisconsin,Male,40 to 64,267079,109918,18683,65988,21828,50662
596,Wisconsin,Female,25 and older,678458,157128,110228,115325,141116,154661
597,Wisconsin,Female,25 to 39,238897,66396,38276,41270,31777,61178
598,Wisconsin,Female,40 to 64,315212,72205,50705,66090,59371,66841

Мы отфильтровали данные для держателей степени бакалавра в областях искусства, гуманитарных наук и других областях (Arts, Humanities and Others), у которых более 30 000 дипломов

In [8]:
sorted_data = df.sort_values(by = ['State', 'Bachelor\'s Degree Holders', 'Science and Engineering'],
							 ascending = [True, False, False])

sorted_data

,State,Sex,Age Group,Bachelor's Degree Holders,Science and Engineering,Science and Engineering Related Fields,Business,Education,"Arts, Humanities and Others"
0,Alabama,Total,25 and older,885357,263555,98445,210147,141071,172139
8,Alabama,Female,25 and older,479739,104189,72441,96238,111581,95290
2,Alabama,Total,40 to 64,418480,115762,46724,112271,63875,79848
4,Alabama,Male,25 and older,405618,159366,26004,113909,29490,76849
1,Alabama,Total,25 to 39,268924,90736,32378,58515,29342,57953
...,...,...,...,...,...,...,...,...,...
606,Wyoming,Male,40 to 64,24149,11145,1230,5077,2700,3997
609,Wyoming,Female,25 to 39,18180,6708,2268,1936,3313,3955
607,Wyoming,Male,65 and older,16482,9375,1145,2011,2378,1573
611,Wyoming,Female,65 and older,14357,3752,2008,1093,5318,2186
605,Wyoming,Male,25 to 39,13852,5451,998,2726,834,3843

Мы отсортировали данные сначала по штатам в алфавитном порядке, затем в убывающем порядке по числу держателей степени бакалавра и, наконец, в убывающем порядке по числу держателей степени бакалавра в области науки и инженерии. Это позволит нам увидеть, какие штаты имеют наибольшее количество держателей степени бакалавра и сколько из них обучались в области науки и инженерии

# Условие 2

In [10]:
sex_frequency = df['Sex'].value_counts()
sex_frequency

Sex
Total     204
Male      204
Female    204
Name: count, dtype: int64

Создадим частотную таблицу для переменной "Пол" и определим, сколько мужчин и женщин представлено в данных. Здесь мы видим, что в данных представлено равное количество мужчин и женщин.

In [12]:
age_group_frequency = df['Age Group'].value_counts()
age_group_frequency

Age Group
25 and older    153
25 to 39        153
40 to 64        153
65 and older    153
Name: count, dtype: int64

Создадим частотную таблицу для переменной "Возрастные группы" и определим, сколько человек принадлежит к каждой возрастной группе. Здесь мы видим, что в данных представлено равное количество всех возрастных групп

In [14]:
state_frequency = df['State'].value_counts()
state_frequency

State
Alabama                 12
Pennsylvania            12
Nevada                  12
New Hampshire           12
New Jersey              12
New Mexico              12
New York                12
North Carolina          12
North Dakota            12
Ohio                    12
Oklahoma                12
Oregon                  12
Rhode Island            12
Montana                 12
South Carolina          12
South Dakota            12
Tennessee               12
Texas                   12
Utah                    12
Vermont                 12
Virginia                12
Washington              12
West Virginia           12
Wisconsin               12
Nebraska                12
Missouri                12
Alaska                  12
Idaho                   12
Arizona                 12
Arkansas                12
California              12
Colorado                12
Connecticut             12
Delaware                12
District of Columbia    12
Florida                 12
Georgia                 12
Hawaii                  12
Illinois                12
Mississippi             12
Indiana                 12
Iowa                    12
Kansas                  12
Kentucky                12
Louisiana               12
Maine                   12
Maryland                12
Massachusetts           12
Michigan                12
Minnesota               12
Wyoming                 12
Name: count, dtype: int64

Создадим частотную таблицу для переменной "Штат" и определим, сколько записей есть для каждого штата. Здесь мы видим, что в данных представлено равное количество всех штатов

In [15]:
engineering_frequency = df['Science and Engineering'].value_counts()
engineering_frequency

Science and Engineering
263555    1
6916      1
338941    1
132477    1
162264    1
         ..
215874    1
79686     1
94395     1
41793     1
3752      1
Name: count, Length: 612, dtype: int64

Создадим частотную таблицу для переменной "Science and Engineering" и определим, сколько записей есть для каждого штата. Здесь мы видим, что в данных представлено равное количество.

In [16]:
age_25_and_older_frequency = filtered_data_age['Sex'].value_counts()
age_25_and_older_frequency

Sex
Total     51
Male      51
Female    51
Name: count, dtype: int64

Здесь мы видим, что внутри отфильтрованных данных для возрастной группы "25 and older" также присутствует равное количество мужчин и женщин.

In [17]:
engineering_frequency = filtered_data_engineering['Science and Engineering'].value_counts()
engineering_frequency

Science and Engineering
263555    1
326329    1
117602    1
800921    1
277349    1
         ..
110698    1
699103    1
228361    1
338275    1
157128    1
Name: count, Length: 253, dtype: int64

Результат показывает, сколько держателей степени бакалавра обучались в области науки и инженерии с разными количествами дипломов.

In [18]:
business_frequency = filtered_data_business['Business'].value_counts()
business_frequency

Business
210147    1
77851     1
70047     1
224461    1
56498     1
         ..
51037     1
76723     1
85315     1
67614     1
66090     1
Name: count, Length: 279, dtype: int64

Эта частотная таблица показывает, сколько держателей степени бакалавра обучались в области бизнеса с разными количествами дипломов.

In [19]:
education_frequency = filtered_data_education['Education'].value_counts()
education_frequency

Education
46314     2
37615     2
141071    1
100615    1
48333     1
         ..
30584     1
33741     1
21095     1
85420     1
16638     1
Name: count, Length: 466, dtype: int64

Результат показывает, сколько держателей степени бакалавра обучались в области образования с разными количествами дипломов.

In [20]:
arts_frequency = filtered_data_arts['Arts, Humanities and Others'].value_counts()
arts_frequency

Arts, Humanities and Others
33222     2
172139    1
140600    1
112101    1
305131    1
         ..
59088     1
53806     1
140248    1
34027     1
66841     1
Name: count, Length: 395, dtype: int64

Результат показывает, сколько держателей степени бакалавра обучались в областях искусства, гуманитарных наук и других областях с разными количествами дипломов.

In [24]:
df['Science and Engineering Percentage'] = (df['Science and Engineering'] / df["Bachelor's Degree Holders"]) * 100
df

,State,Sex,Age Group,Bachelor's Degree Holders,Science and Engineering,Science and Engineering Related Fields,Business,Education,"Arts, Humanities and Others",Science and Engineering Percentage
0,Alabama,Total,25 and older,885357,263555,98445,210147,141071,172139,29.768218
1,Alabama,Total,25 to 39,268924,90736,32378,58515,29342,57953,33.740388
2,Alabama,Total,40 to 64,418480,115762,46724,112271,63875,79848,27.662493
3,Alabama,Total,65 and older,197953,57057,19343,39361,47854,34338,28.823509
4,Alabama,Male,25 and older,405618,159366,26004,113909,29490,76849,39.289676
...,...,...,...,...,...,...,...,...,...,...
607,Wyoming,Male,65 and older,16482,9375,1145,2011,2378,1573,56.880233
608,Wyoming,Female,25 and older,59074,15570,8470,6856,16638,11540,26.356773
609,Wyoming,Female,25 to 39,18180,6708,2268,1936,3313,3955,36.897690
610,Wyoming,Female,40 to 64,26537,5110,4194,3827,8007,5399,19.256133
611,Wyoming,Female,65 and older,14357,3752,2008,1093,5318,2186,26.133593

Создадим новую переменную, которая будет представлять собой отношение количества держателей степени бакалавра в области науки и инженерии к общему количеству держателей степени бакалавра в каждом штате. Это отношение может дать представление о том, какой процент от всех бакалавров в каждом штате обучался в научных и инженерных областях.